<?php

return [
    //验证码发送文案
    '邮箱验证码发送文案' => 'رمز التحقق من البريد الإلكتروني لإرسال نسخة',
    '语音验证码发送文案' => 'رمز التحقق الصوتي لإرسال نسخة',
    //成功类型提示
    '验证码发送成功' => 'تم إرسال رمز التحقق بنجاح',
    '验证通过' => ',تم التحقق',
    '验证不通过' => 'فشل التحقق',
    ///失败类型提示
    '当天邮箱验证码次数超限,请明天再试' => 'لقد نفد الحد الأقصى لعدد أكود التحقق من البريد الإلكتروني اليوم ، يرجى المحاولة غدًا',
    '当天短信验证码次数超限,请明天再试' => 'لقد نفد الحد الأقصى لرمز التحقق من الرسائل القصيرة اليوم ، يرجى المحاولة غدًا',
    '当天语音验证码次数超限,请明天再试' => 'لقد نفد رمز التحقق من ivr اليوم ، يرجى المحاولة غدًا',
    '1分钟内不能频繁发送验证码' => 'لا يمكن إرسال رمز التحقق مرة أخرى خلال دقيقة واحدة',
    '发送验证码异常,请稍后再试' => 'خطأ ، يرجى المحاولة مرة أخرى في وقت لاحق',
    //验证不通过类型提示
    //'验证码不正确' => 'إدخال رمز خاطئ',
    '验证码不正确' => 'إدخال رمز خاطئ',
    '邮箱验证码不正确' => 'رمز تحقق البريد الإلكتروني غير صحيح',
    '手机号格式不正确' => 'تنسيق رقم الهاتف غير صحيح . ',
    '请输入验证码' => 'من فضلك ادخل رمز التحقيق',
    '没有查到对应的aadhaar no' => 'لم يتم العثور علي رقم aadhaar',
    '发送成功!' => 'تم الإرسال بنجاح!',
    '工作邮箱验证成功' => 'نجاح التحقق من البريد الإلكتروني للعمل ',
    '工作邮箱验证失败' => 'فشل التحقق من البريد الإلكتروني للعمل ',
    '验证码不能为空' => 'لا يمكن أن يكون رمز التحقق فارغًا ',
    '系统出现异常，请10分钟之后再试' => 'خطأ في النظام ، يرجى المحاولة بعد 10 دقائق ',
    '没有对应的记录' => 'لا يوجد تسجيل مطابق',
    '暂无结果' => 'لا يوجد نتيجة مؤقتا',
    '超过5次,请明天再试一次' => 'تجاوزت أكثر من 5 مرات.  ارجوك حاول مرة أخرى غدا',
    '请稍后再试' => 'خطأ ， يرجى المحاولة مرة أخرى لاحقًا.',
    '验证码过期' => 'انتهاء صلاحية رمز التحقق ',
    'aadhaar和电话不匹配' => 'الرقم الذي أدخلته لا يتطابق مع رقم الجوال المسجل في مركز Aadhaar',
    '验证码已经发送' => 'تم إرسال رمز التحقق إلى هاتفك المحمول',
    '请输入手机号' => 'الرجاء إدخال رقم الهاتف الخلوي.',
    '邮箱不正确' => 'رقم البريد الإلكتروني غير صحيح.',
    '手机号不正确' => 'رقم الهاتف غير صحيح.',
    '未录入手机号' => 'لم يتم إدخال رقم الهاتف المحمول.',
    '密码不正确' => 'كلمة سر غير صحيحة',
    '已经注册请登录' => 'تم تسجيل الدخول سجل من فضلك',
];
