<?php

return [
    // 订单状态  حالة الطلب 
    '待确认借款' => 'سيتم تأكيد القرض',
    '已签约待放款' => 'توقيع عقد القرض',
    '待系统机审' => 'في انتظار مراجعة النظام',
    '机审中' => 'قيد الاستعراض',
    '待人工审核' => 'تخضع للمراجعة اليدوية',
    '人工审核通过待签约' => 'المراجعة اليدوية والموافقة على التوقيع',
    '系统审核通过待签约' => 'تمت الموافقة على النظام وسيتم التوقيع عليه',
    '系统审核拒绝' => 'رفض النظام الطلب',
    '人工审核拒绝' => 'رفض المراجعة اليدوية',
    '待补充资料' => 'معلومات إضافية يمكن ان تضاف',
    '放款处理中' => 'معالجة القروض/الدفع',
    '系统出款成功待还款' => 'قام النظام بسحب ناجح وسيتم سداده',
    '人工出款成功待还款' => 'السحب اليدوي ناجح وفي انتظار السداد',
    '系统出款失败' => 'فشل سحب النظام',
    '人工出款失败' => 'فشل السحب اليدوي',
    '人工取消借款' => 'الإلغاء اليدوي للقروض',
    '用户取消借款' => 'المستخدم يلغي القرض',
    '借款已逾期' => 'انتهت صلاحية القرض',
    '还款处理中' => 'معالجة الدفع',
    '正常结清' => 'التسوية العادية',
    '逾期结清' => 'التسوية المتأخرة',
    '已坏账' => 'مجموعة سيئة/دين غير مضمون التحصيل',
    '待电审' => 'انتظر الموافقة على المكالمة/قيد الأستعراض',
    '待电二审' => 'في أنتظار الموافقه الثانيه علي المكالمه ',
    '系统取消借款' => 'إلغاء نظام القرض',
    // 合同相关العقد ذات الصلة
    '借款合同' => 'عقد القرض',
    '合同签约中' => 'توقيع العقد',
    '订单已签约' => 'تم التوقيع على الطلب',
    '非分期订单' => 'أمر بعدم التقسيط',
    '未到最后一期' => 'ليس بعد العدد الأخير/ليس لخطة السداد الأخيرة',
];

