<?php

return [
    '请填写卡号' => 'من فضلك أكتب رقم البطاقه',
    '请选择或填写ifsc' => 'الرجاء تحديد أو ملء',
    'ifsc不正确，请重新选择或填写' => 'ifsc غير صحيح ، يرجى إعادة التحديد أو ملء',
    '请输入银行名称' => 'الرجاء إدخال اسم البنك.',
    '类型不能为空' => 'لا يمكن أن يكون النوع فارغًا',
    '类型不正确' => 'نوع غير صحيح',
    '请选择借款金额' => 'الرجاء تحديد مبلغ القرض.',
    '请选择借款天数' => 'الرجاء تحديد عدد الأيام للاقتراض',
    'id不能为空' => 'لا يمكن أن يكون المعرف فارغًا "',
    '用户不存在' => 'المستخدم غير موجود',

    // ConfigRule
    '预警值必须小于 日最大申请笔数' => "يجب أن تكون قيمة التحذير أقل من الحد الأقصى لعدد الطلبات في اليوم'",
    '预警值必须小于 日最大放款金额' => "يجب أن تكون قيمة التحذير أقل من الحد الأقصى لمبلغ القرض اليومي'",

    '请选择部分还款类型' => 'يرجى اختيار نوع السداد الجزئي',
];
