<?php

return [
    '4560A8 ' => "{{captcha}} هو رمز التحقق الخاص بك, مرحبًا بك للتسجيل في {{appName}} ، ستنتهي صلاحية هذا الرمز في غضون 5 دقائق. ", //验证码sms//  
    '0C9706 ' => "أنت تستخدم رمزًا ديناميكيًا {{captcha}} لإعادة تعيين كلمة المرور الخاصة بك.  تأكد من استخدامه بنفسك. ستنتهي صلاحية هذا الرمز الديناميكي في غضون 5 دقائق.", //修改密码验证码//   
    '0C9705 ' => "تذكير بـ {{appName}} ، نهايتك مبلغ القرض المعتمد هو EGP {{amount}} ، وسيتم صرفه إلى حسابك المخصص.", //修改额度触发//   
    '096DA8 ' => "عزيزي المستخدم: لقد تمت الموافقة عليك بنجاح {{amount}} EGP / {{loan_days}} الايام ، وستصل الأموال إلى حسابك المخصص في غضون يومين عمل.", //审批通过成功短信//   
    "219851" => "تذكير بـ {{appName}} ، رقم التحكم الخاص بك هو: {{withdraw_no}} ، استخدمه للمطالبة بالنقود باستخدام معرّفك الصالح في أي فرع {{channel}}.", //放款短信-线下取款客户// 
    "B64AAD" => 'تذكير! اقتراض {{appName}}" تم صرف EGP {{amount}} إلى حسابك المخصص ، يرجى التحقق من حسابك. رقم مرجع الدفع الخاص بك هو {{reference_no}}.', //放款成功短信-线上取款客户//
//  "B64DDD" => "مبروك!  قرضك بمبلغ {{المبلغ}}EGP/تم صرف {{قرض_أيام}} يوم بنجاح.  السداد عبر DragonPay Partners 7-11، LBC، Bayad Center، Cebuana.  الرقم {{رقم المرجع}}.", //放款成功短信-线下取款客户
    "B64DDD" => "تهانينا! تم بنجاح صرف القرض الذي تبلغ قيمته {{amount}} EGP / {{loan_days}} يوم. السداد عبر SkyPay Partners 7-11 ، ML ، RD ، ECPay ، GCash ، FastLoan ، رقم مرجع Paymaya {{reference_no}}.", //放款成功短信-线下取款客户//    
    "B64ADD" => "رقم التحكم الخاص بك هو {{withdraw_no}} ، والذي سينتهي خلال {{days}} ، يمكنك المطالبة نقدًا باستخدام معرّفكid الصالح في أي فرع من فروع {{channel}}", //放款短信-线下取款客户skypayl渠道再次提醒客户取款 执行放款后的1,3,5,7天 7:00//    
    "B64ADC" => "تذكير بـ {{appName}} ، فشل الصرف بسبب مشاكل مصرفية أو انتهاء صلاحية رقم التحكم ، الرجاء إعادة التقديم إذا لزم الأمر.", //放款短信-放款失败（核心状态为撤销）//    
# 20210520 Tracy 更新    
    "65A8AF" => " سيدي / سيدتي ، قرضك على وشك الانتهاء ، يرجى معالجة السداد في الوقت المحدد.  يمكن لأول 20٪ من العملاء الذين يسددون اليوم إعادة اقتراض ما يصل إلى 12000 بيزو.  إذا كنت مهتمًا يمكنك التقديم مباشرة بعد السداد ، إذا كانت لديك أسئلة ، فيرجى الاتصال بنا", //到期T-2提醒短信模板 9：00//    
    "65A8AD" => " سيدي / سيدتي ، انتهى القرض الخاص بك اليوم ، يرجى معالجته قبل الساعة 12:00 مساءً حتى تكون مؤهلاً لأول 20٪ من العملاء المحظوظين.  وفقًا لدرجة ائتمان عملائنا ، سيكون من الممكن إعادة اقتراض حد ائتمان يصل إلى 12000 بيزو.  إذا كنت مهتمًا يرجى التقديم مباشرة بعد السداد.  إذا كان لديك أسئلة، من فضلك تواصل معنا", //到期T提醒短信模板  7：00//   
    "B49B8B" => "قرض {{appName}} الخاص بك: php {{amount}} فات موعد استحقاقه. ربما فاتك موعد استحقاقك.  يرجى دفع رصيدك في أسرع وقت ممكن للحفاظ على وضع ائتماني جيد", //逾期T1  9:00//    
    "E84A90" => "تحذير: لم يتم استلام أي مدفوعات منك بالرغم من كل التذكيرات.  يرجى دفع رصيدك في أسرع وقت ممكن لتجنب جهود التحصيل المستقبلية.  شكرا لك", //逾期T+3  9:00//   
    "ACCFCD" => "عزيزي العميل ، شكرًا لاستخدام قرض {{appName}} ، سنكون سعداء دائمًا بخدمتك مرة أخرى.  أعود إلينا كلما احتجت إلينا!", //结清客户仅在结清次日10:00发送/   
    "ACCFCE" => "لقد تقدمت بطلب للحصول على تمديد بنجاح ، يرجى الدفع بالكامل اليوم: {{amount}} لتجنب فشل التمديد ، شكرًا لك على تعاونك", //展期预约//   
    "B64AAA" => "عزيزي مستخدمي {{appName}} ، لقد قدمت المعلومات التي لا تفي بمعايير الموافقة ، يرجى إعادة إرسال هذه المعلومات على التطبيق {{appName}} في غضون {{days}} من الأيام", //补件//
];
