<?php


return [
    //workbench
    '注册放款转化率' => 'سجل معدل تحويل القرض ',
    '（新/复贷）' => '(جديد / إعادة تمويل)',
    '日应还金额    ¥' => 'مبلغ السداد اليومي ₹',
    '承诺应还金额    ¥' => 'المبلغ الواجب سداده ₹',
    '入催率' => 'معدل الدخول',
    '承诺还款率' => 'معدل سداد الالتزام',
    '催回率' => 'معدل الاسترجاع',
    '坏账率' => 'نسبة الديون المعدومة',
    '催记率' => 'معدل التذكير',
    '承诺应还金额' => 'مبلغ سداد الوعد اليومي',
    '机审通过转化率' => 'مراجعة الجهاز معدل تحويل النجاح',
    '初审通过转化率' => 'معدل تحويل الموافقة الأولى',
    '电审通过转化率' => 'معدل تحويل الموافقة على المكالمات',
    '签约完成转化率' => 'معدل تحويل إتمام العقد',
    '自然流量' => 'معدل التدفق الطبيعي',
];
?>
