<?php

return [

 //成功类型提示أشاره الي الأنواع الناجحه
    '登录成功' => 'نجاح التسجيل',
    '绑定成功' => 'نجح الربط',
    '邮箱绑定成功' => 'ربط البريد الإلكتروني ناجح',
    '替换绑定成功' => 'نجح ربط الاستبدال',
    '手机号码绑定成功' => 'تم ربط رقم الهاتف المحمول بنجاح, ',

    //失败类型提示أشاره الي فشل الأنواع
    '生成token失败' => 'فشل إنشاء الرمز المميز',
    '绑定失败，邮箱已存在' => 'failure of binding, the email is already existed  ',
    '该手机已绑定facebook账号,是否替换原账号' => 'تم ربط الهاتف بحساب فيسبوك سواء ليحل محل الحساب الاصلي? ',
    '绑定失败,请退出重试' => 'فشل الربط ، يرجى الإنهاء والمحاولة مرة أخرى ',
    '邮箱未绑定' => 'البريد الكتروني غير مرتبط',

    //验证不通过类型提示أشاره التحقيق لاتجتاز ÷ذا النوع 
    '邮箱不正确' => 'البريد الألكتروني غير صحيح.',
    '手机号格式不正确' => 'رقم الهاتف غير صحيح.',

    '缺少facbook_id参数' => 'عدم وجود معلمات facbook_id',
    '绑定失败1' => 'فشل الربط 1',
    '绑定失败2' => 'فشل الرابط2',
    '绑定失败3' => 'فشل الرابط3',

    '州与城市不对应' => 'الدولة لا تتوافق مع المدينة',

    '请输入参数' => 'الرجاء إدخال المعلمات',
    '请填写职业' => 'الجاء أدخال المهنه',
    '请填写公司' => 'الرجاء أدخال أسم الشركه',

    '上传类型不能为' => 'لا يمكن أن يكون نوع التحميل ',
    '上传类型不能为空' => 'لا يمكن أن يكون نوع التحميل فارغًا',

    '文件id不能为空' => 'لا يمكن أن يكون معرف الملف فارغًا',
    '银行流水文件不存在' => 'ملف كشف الحساب المصرفي غير موجود',
    '最多只能上传6个文件' => 'تحميل ما يصل إلى 6 ملفات فقط',

    '全部' => 'كل',
    '新用户' => 'مستخدم جديد',
    '老用户' => 'مستخدم قديم',
    '复贷用户' => 'مستخدم إعادة التمويل',
    '当日注册用户' => 'الأعضاء المسجلين في اليوم',

    '限制注册' => 'تسجيل مقيد',
    '限制登录' => 'تسجيل الدخول المقيد',
    '限制认证' => 'تقييد المصادقة',
    '限制借款' => 'تقييد القرض',

    '本人' => 'نفسه - ذاته',
    '联系人' => 'جهه الاتصال',
    '父母' => 'الوالدين',
    '配偶' => 'زوج',
    '子女' => 'طفل',
    '朋友' => 'اصدقاء',
    '同事' => 'زملاء العمل',
    '亲属' => 'أقارب',
];
