<?php

namespace Risk\Docs\apidoc\Api;

/**
 * 风控回调
 * @package Risk\Docs\apidoc\Api
 */
interface CallbackDoc
{
    /**
     * @api {post} 创建机审时上传的notice_url 机审结果回调
     * @apiGroup Callback
     * @apiVersion 1.0.0
     * @apiDescription 机审结果回调。接口返回'SUCCESS'表示回调处理成功。若无接收到'SUCCESS'，系统会再次回调，回调6次后不再处理回调
     *
     * @apiParam {String} task_no task_no
     * @apiParam {String} order_id order_id
     * @apiParam {String} status 机审状态  完成:FINISH  异常:EXCEPTION
     * @apiParam {String} result 机审结果  通过:PASS  拒绝:REJECT  异常:NA
     * @apiParam {String} hit_rule_code 机审命中项，多项以','分隔  10009,10012,80002
     * @apiParam {String} task_desc 备注信息
     *
     * @apiSuccessExample {json} 返回值：
     * SUCCESS
     *
     * @apiSampleRequest off
     *
     * @apiErrorExample {json} 通过回调:
     * {"hit_rule_code":"100000","order_id":"125915","result":"REJECT","status":"FINISH","task_desc":"\u89c4\u5219\u672a\u901a\u8fc7","task_no":"TASK_F3C80626BFCB6AEE"}
     *
     * @apiErrorExample {json} 拒绝回调:
     * {"hit_rule_code":"","order_id":"88995955","result":"PASS","status":"FINISH","task_desc":"\u89c4\u5219\u901a\u8fc7","task_no":"TASK_663EA8F14639F36D"}
     *
     * @apiErrorExample {json} rule_code
     * 1XXXX 准入拒绝
     * 2XXXX 设备不符合
     * 3XXXX 申请异常
     * 4XXXX 通讯录不符合要求
     * 5XXXX 历史表现不良
     * 6XXXX 其他
     * 8XXXX|9XXXX 第三方数据不合格
     */

    /**
     * @api {post} rule_code rule_code
     * @apiGroup Callback
     * @apiVersion 1.0.0
     * @apiDescription 机审结果回调
     *
     * @apiIgnore 暂时隐藏code详情
     *
     * @apiSampleRequest off
     *
     * @apiErrorExample {json} rule_code
     * ================================= 准入拒绝 ==============================================
     * 10001 => '年龄不符合',
     * 10004 => '学历不符合',
     * 10005 => '职业不符合',
     * 10008 => '地址不符合',
     * 60001 => '设备不符合',
     * 60002 => '设备不符合',
     * 10014 => '设备不符合',
     * 10015 => '联系人不符合',
     * 10016 => '设备不符合',
     * 10017 => '年龄学历不符合',
     * 10018 => '基础信息多重验证未通过',
     * 10019 => '渠道拒绝',
     * 10020 => '联系人不符合',
     * 10022 => '地址不符合',
     * 10023 => '银行不合格',
     * 80001 => '手机号未通过',
     * 80002 => '手机号未通过',
     * 80003 => '手机号未通过',
     * 80004 => '手机号未通过',
     * 80005 => '手机号未通过',
     * 80006 => '手机号未通过',
     * 80007 => '联系人手机号未通过',
     * 80008 => '联系人手机号未通过',
     * 10021 => '职业综合认证未通过',
     * 80009 => '联系人未通过',
     * 80010 => '联系人未通过',
     * 80011 => '手机号未通过',
     * 80012 => '联系人未通过',
     * 80013 => '联系人未通过',
     * 70001 => '多头数据不合格',
     * 30008 => '人脸不合格',
     *
     * ================================= 历史表现不良 ==============================================
     * 10003 => '黑名单',
     * 20004 => '设备有逾期历史',
     * 50001 => '历史被拒次数过多',
     * 50002 => '历史逾期次数过多',
     * 50003 => '历史逾期天数过多',
     * 50004 => '历史逾期天数过多',
     * 50005 => '历史催收次数过多',
     * 50006 => '可疑行为拦截',
     *
     * ================================= 申请异常 ==============================================
     * 10002 => '申请间隔过短',
     * 10006 => '填写时长过短',
     * 10007 => '申请时间段不符合',
     * 20003 => '设备有在途申请',
     * 20008 => '设备类型不符合',
     * 20002 => '设备在规定天数申请多次',
     * 20007 => '设备规定时间段申请多次',
     * 10012 => '验证时间段不符合',
     * 10011 => '地区申请密集',
     * 20009 => '设备属性不支持',
     * 20010 => '设备属性不支持',
     * 30010 => '识别比对未匹配',
     * 30011 => '识别比对未匹配',
     * 30012 => '识别比对未匹配',
     * 30013 => '识别比对未匹配',
     * 10013 => '网络地址异常',
     * 20011 => '设备异常变更',
     * 30014 => '识别比对未匹配',
     *
     * ================================= 用户关联 ==============================================
     * 20001 => '设备重复申请',
     * 20005 => '设备匹配多证件',
     * 20006 => '设备匹配多手机号',
     * 30004 => '证件匹配多号码',
     * 30005 => '证件匹配多设备',
     * 10009 => '关联账号过多',
     * 10010 => '关联账号过多',
     * 30001 => '关联账号过多',
     * 30002 => '关联账号过多',
     * 30003 => '关联账号过多',
     * 30006 => '关联账号有被拒订单',
     * 30007 => '关联账号有在途申请',
     * 30009 => '关联账号申请过多',
     * 60003 => '关联账号申请过多',
     * 60004 => '关联账号申请条件不符',
     * 60005 => '关联账号申请条件不符',
     *
     * ================================= 通讯录不符合要求 ==============================================
     * 40001 => '通讯录在途申请过多',
     * 40002 => '通讯录逾期人数过多',
     * 40003 => '通讯录不合格',
     * 40004 => '通讯录不合格',
     * 40005 => '通讯录不合格',
     * 40006 => '通讯录不合格',
     * 40007 => '通讯录不合格',
     *
     */

}
